marchMadness/app/controllers/players_controller.rb

SELECT * FROM "players"
---
  def index
    @players = Player.all

SELECT * FROM "players" WHERE ("players"."playerId" = '88965') LIMIT 1
---
  def team
    Ncaateam.new.load params[:teamAbbrev]

    @players = Player.all