marchMadness/app/controllers/scores_controller.rb

SELECT * FROM "scores"
---
  def index
    @scores = Score.all

SELECT * FROM "scores" WHERE ("scores"."gameId" = '201012280357')
---
  def game
    Game.new.load params[:gameId]

    @scores = Score.find(:all, :conditions => {:gameId => params[:gameId]})